unlock(); 
launchApp("微信"); 
sleep(300); 
click("发现"); 
sleep(300); 
click("小程序"); 
sleep(300); 
click("我的小程序"); 
sleep(300); 
click("龙湖天街"); 
sleep(8000); 
click(500, 1900); 
sleep(300); 
//click("签到积分"); 
click (100,800); 
sleep(500); 
//click("立即签到"); 
click (540,1400); 
function unlock(){ 
    if(!device.isScreenOn())
    { 
        device.wakeUp(); 
        swipe(500,30,500,1000,300); 
        sleep(400); 
        /*手机屏幕尺寸 2340*1080
        滑动解锁 九个点对应的坐标
        235,1261	540,1261	844,1261
        235,1566	540,1566	844,1566
        235,1870	540,1870	844,1870*/
        gesture(1000, [540,1261], [540,1566], [540,1870], [844,1870], [844,1566], [540,1566], [235,1566]); 
    } 
}